//HERC01R5 JOB (COBOL),' ',CLASS=C,MSGCLASS=X,REGION=8M,
//             TIME=1440,MSGLEVEL=(1,1),NOTIFY=HERC01
//DELANT EXEC PGM=IEFBR14
//ATUOUT DD DSNAME=HERC01.CLIENTES.ATU,
// DISP=(MOD,DELETE,DELETE),
// UNIT=SYSDA,
// SPACE=(TRK,(1,1)),
// DCB=(RECFM=FB,LRECL=44,BLKSIZE=440)
//RELAT DD DSNAME=HERC01.RELAT.P5,
// DISP=(MOD,DELETE,DELETE),
// UNIT=SYSDA,
// SPACE=(TRK,(1,1)),
// DCB=(RECFM=FB,LRECL=132,BLKSIZE=1320)
//ERROUT DD DSNAME=HERC01.ERROS.TXT,
// DISP=(MOD,DELETE,DELETE),
// UNIT=SYSDA,
// SPACE=(TRK,(1,1)),
// DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)
//SORTCLI EXEC PGM=SORT
//SORTLIB DD DSNAME=SYS1.SORTLIB,DISP=SHR
//SYSOUT DD SYSOUT=*
//SORTIN DD DSNAME=HERC01.CLIENTES.TXT,DISP=SHR
//SORTOUT DD DSNAME=&&CLIORD,
// DISP=(NEW,PASS),
// UNIT=SYSDA,
// SPACE=(TRK,(2,2)),
// DCB=(RECFM=FB,LRECL=44,BLKSIZE=440)
//SYSIN DD *
 SORT FIELDS=(1,5,CH,A)
/*
//SORTTRX EXEC PGM=SORT,COND=(0,NE,SORTCLI)
//SORTLIB DD DSNAME=SYS1.SORTLIB,DISP=SHR
//SYSOUT DD SYSOUT=*
//SORTIN DD DSNAME=HERC01.TRANSAC.TXT,DISP=SHR
//SORTOUT DD DSNAME=&&TRXORD,
// DISP=(NEW,PASS),
// UNIT=SYSDA,
// SPACE=(TRK,(2,2)),
// DCB=(RECFM=FB,LRECL=20,BLKSIZE=200)
//SYSIN DD *
 SORT FIELDS=(1,5,CH,A,6,5,CH,A)
/*
//RUNCOB EXEC PGM=PROJETO5,COND=(0,NE)
//STEPLIB DD DSNAME=HERC01.LOAD,DISP=SHR
//SYSOUT DD SYSOUT=*
//CLIIN DD DSNAME=&&CLIORD,
// DISP=(OLD,DELETE),
// DCB=(RECFM=FB,LRECL=44,BLKSIZE=440)
//TRXIN DD DSNAME=&&TRXORD,
// DISP=(OLD,DELETE),
// DCB=(RECFM=FB,LRECL=20,BLKSIZE=200)
//ATUOUT DD DSNAME=HERC01.CLIENTES.ATU,
// DISP=(NEW,CATLG,CATLG),
// UNIT=SYSDA,
// SPACE=(TRK,(2,2),RLSE),
// DCB=(RECFM=FB,LRECL=44,BLKSIZE=440)
//RELAT DD DSNAME=HERC01.RELAT.P5,
// DISP=(NEW,CATLG,CATLG),
// UNIT=SYSDA,
// SPACE=(TRK,(3,2),RLSE),
// DCB=(RECFM=FB,LRECL=132,BLKSIZE=1320)
//ERROUT DD DSNAME=HERC01.ERROS.TXT,
// DISP=(NEW,CATLG,CATLG),
// UNIT=SYSDA,
// SPACE=(TRK,(2,2),RLSE),
// DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)
//
